local config = {}
--//Creator.Fa : @amir_sezar
config.errorlinkfilename = "خطا ، این فایل قابل شناسایی نمی باشد❗️"
config.errorlinkfilecont = "لینک از این فایل قابل شناسایی نیستند ، دوباره تلاش کنید❗️"
config.oklinkfileread = "لینک ها از این فایل خوانده و شناسایی شدند\nتعداد لینک ها:"
config.profilechanged = "پروفایل ربات تغییر یافت❗️"
config.savednumeralready = " شمارت ذخیره هستش |:"
config.adminsavenumber = " مدیر عزیز ، شماره شما ذخیره شده است :)"
config.welcometext = " سلام دوست من 😁 \n\n✍🏻 از شما برای انتخاب ما سپاسگزاریم\n\n— مشاهده اطلاعات مربوط به ربات با : اطلاعات\n— مشاهده تنظیمات با : تنظیمات \n\n📎گیت هاب : https://github.com/isDev-ir/tabi | v3.8.1 "
config.promotesudo = " کاربر به ادمین ربات ارتقا یافت❗️"
config.demotesudo = " کاربر از لییت ادمین های ربات عزل شد❗️"
config.addtoalltext = "کاربر مورد نظر به همه گروه ها و سوپرگروه ها افزوده شد❗️"
--//Creator.Fa : @amir_sezar
--//SETTINGS MENU
config.denyall = "🚫"
config.checkall = "✅"
config.setttops = "🖥تنظیمات ربات "
config.settingsname = "\n\n🔨 تنظیمات:"
config.settjoin = "\n🔹عضویت خودکار : "
config.settfindlink = "\n🔸شناسایی لینک : "
config.settoklink = "\n🔹تاییدلینک : "
config.settaddcontact = "\n🔸افزودن مخاطب : "
config.fauto = "\n🔹فوروارد خودکار : "
config.groupleftt = "\n🔸لفت از گروه : "
config.leftnamess = "\n🔹خروج از گروهی که نامش محدود است : "
config.restricslefts = "\n🔸خروج از گروه محدود  : "
config.settmarkread = "\n🔹تیک دوم : "
config.settaddcontext = "\n🔸ارسال پیام افزودن مخاطب : "
config.settsendnumadd = "\n🔹ارسال شماره هنگام افزودن م : "
config.setttelenot = "\n🔸دریافت پیام های تلگرام : "
config.settautoleave = "\n🔹لفت خودکار : "
config.settfiltergp = "\n🔸لفت از گروه فیلتر : "
config.settsectext = "\n🔹منشی خصوصی : "
config.settgetadminlink = "\n🔸گرفتن لینک از سودو : "
config.settgroupsec = "\n🔹منشی گروه : "
config.settfrand = "\n🔸فوروارد خودکار رندوم : "
config.autotimer = "\n🔹زمان خروج خودکار : "
config.addleftsett = "\n🔸افزودن رباتAPI سپس لفت : "
config.fwdleftsett = "\n🔹فوروارد،سپس لفت : "
config.checkopensett = "\n🔸خروج گروه های اد بسته : "
config.settchannel = "\n🔹لفت از کانال ها : "
config.footersett = "\n\n✍🏻ورژن: 3.8.1"
--//END SETTINGS MENU

--//INFO MENU
config.infotop = "🖥اطلاعات ربات تبچی "
config.infoid = "\n🔹آیدی ربات : "
config.infoname = "\n🔸نام ربات : "
config.infonum = "\n🔹شماره ربات : "
config.infostat = "\n\n💾 آمار:"
config.infosgp = "\n🔸سوپرگروه ها : "
config.infogp = "\n🔹گروه ها : "
config.infocont = "\n🔸مخاطبین : "
config.infopriv = "\n🔹پیوی ها : "
config.infoadmin = "\n🔸ادمین ها : "
config.infolink = "\n🔹لینک ها : "
config.infowlink = "\n🔸لینک های درحال انتظار : "
config.infojlink = "\n🔹لینک های جوین شده : "
config.infoslink = "\n🔸لینک های سیو شده : "
config.infolgps = "\n🔹لینک های رد شده : "
config.inforgps = "\n🔸گپ های ریمو شده : "
config.infochnums = "\n🔹کانال ها : "
config.infodoings = "\n\n⏱ پردازش ها:"
config.infomaxgp = "\n🔹حداکثر گروه ها : "
config.infominmem = "\n🔸حداقل ممبرها : "
config.infotimetook = "\n🔹زمان تایید لینک : "
config.infojoinagain = "\n🔸زمان جوین شدن : "
config.infolastdoing = "\n🔹آخرین اقدام : "
--//END INFO MENU
--//Creator.Fa : @amir_sezar
config.setname = "نام ربات تغییر یافت به : "
config.setbio = "بیو ربات تغییر یافت به : "
config.setusername = "یوزرنیم ربات تغییر یافت به : "
config.setprofilefirst = "اکنون عکس پروفایل خود را ارسال کنید❗️"
config.fautoadd = "به لیست پیام های ارسال خودکار اضافه شد❗️"
config.fautolist = "لیست ارسال خودکار شما:"
config.fautooutlist = "هیچ پستی برای فوروارد خودکار وجود ندارد❗️"
config.fautorem = "پیام مورد نظر از لیست ارسال خودکار حذف شد❗️"
config.setsecfile = "فایل منشی تبچی تنظیم شد❗️"
config.setsectext = "پیام منشی تنظیم شد❗️"
config.delfautotime = "زمان ارسال خودکار حذف شد❗️"
config.delayjoin = "تاخیر در عضویت تنظیم شد : "
config.delaycheck = "تاخیر شناسایی لینک تنظیم شد : "
config.startfaild = "پیدا نشد❗️"
--//Creator.Fa : @amir_sezar
--//HELP
config.help = [[ 
دستورات راهنمای استفاده از ربات تبلیغاتی در کانال زیر 👇
@isdevTab
-----------
تبچی ورژن : 3.8.1
]] 
--//END HELP
config.ontext = "ربات آنلاین شد❗️"
config.offtext = "ربات خاموش شد برای ثانیه(seconds): "
config.etve = "رمز عبور دو مرحله ای  تایید و تنظیم شد❗️"
config.etvef = "رمز عبور 2 مرحله ای از قبل فعال شده است، لطفاً آن را غیرفعال کنید و رمز عبور جدیدی را تنظیم کنید❗️"
config.savenumon = "ذخیره کردن مخاطب روشن شد❗️"
config.savenumoff = "ذخیره کردن مخاطب خاموش شد❗️"
config.sudogetlinkon = "دریافت لینک فقط از ادمین ها روشن شد❗️"
config.sudogetlinkoff = "دریافت لینک فقط از ادمین ها خاموش شد❗️"
config.fautoon = "فوروارد خودکار روشن شد❗️"
config.randon = "فوروارد رندوم روشن شد❗️"
config.fautoaddfaild = "لطفا اول پیام فوروارد خودکار را تنظیم کنید با دستور :\n/addfauto"
config.fautooff = "فوروارد خودکار خاموش شد❗️"
config.randoff = "فوروارد رندوم خاموش شد❗️"
config.seceron = "منشی روشن شد❗️"
config.secersetfaild = "لطفاً ابتدا پیام منشی را تنظیم کنید : \n/setsecretarymsg"
config.seceroff = "منشی خاموش شد❗️"
config.typefautosgp = "فوروارد خودکار به سوپرگروه تنظیم شد❗️"
config.typefautogp = "فوروارد خودمار به گروه تنظیم شد❗️"
config.typefautosgpgp = "فوروارد خودکار به سوپرگروه و گروه تنظیم شد❗️"
config.typefautopv = "فوروارد خودکار به پیوی ها تنظیم شد❗️"
config.typefautoall = "فوروارد خودکار به همه تنظیم شد❗️"
config.addedcontact = "مخاطبین با موفقیت به گروه اضافه شدند❗️"
config.telegramnoton = "وضعیت دریافت اعلانات تلگرام فعال شد❗️"
config.telegramnotoff = "وضعیت دریافت اعلانات تلگرام غیرفعال شد❗️"
config.leftnameon = "وضعیت لفت از گروه با اسامی خاص روشن شد❗️"
config.leftnameoff = "وضعیت لفت از گروه با اسامی خاص خاموش شد❗️"
config.leftnameclean = "لیست نام های خاص پاک شد❗️"
config.fautocleanlist = "لیست فوروارد خودکار پاک شد و فوروارد خودکار خاموش شد❗️"
config.addcontactcleanlist = "مخاطبین پاک شد❗️"
config.filtergpon = "لفت خودکار از گروه های فیلتر شده فعال شد❗️"
config.filtergpoff = "لفت خودکار از گروه های فیلتر شده غیرفعال شد❗️"
config.grouplefton = "لفت از گروه ها روشن شد❗️"
config.groupleftoff = "لفت از گروه ها خاموش شد❗️"
config.channellefton = "لفت از کانال ها روشن شد❗️"
config.channelleftoff = "لفت از کانال ها خاموش شد❗️"
config.onlinetext = "همیشه آنلاینم (:"
config.joinon = "عضویت در گروه ها روشن شد❗️"
config.joinoff = "عضویت در گروه ها خاموش شد❗️"
config.addlefton = "افزودن ربات به گروه و لفت از گروه روشن شد❗️"
config.addleftoff = "افزودن ربات به گروه و لفت از گروه خاموش شد" 
config.fwdlefton = "فوروارد و لفت از گروه روشن شد❗️"
config.fwdleftoff = "فوروارد و لفت از گروه خاموش شد❗️" 
config.checkopenon = "لفت از گروه هایی که اد انها بسته است روشن شد❗️"
config.checkopenoff = "لفت از گروه هایی که اد انها بسته است خاموش شد❗️" 
config.resticlefton = "لفت از گروه هایی که ربات در ان محروم شده روشن شد❗️"
config.resticleftoff = "لفت از گروه هایی که ربات در ان محروم شده خاموش شد❗️" 
config.findlinkon = "شناسایی لینک روشن شد❗️"
config.findlinkoff = "شناسایی لینک خاموش شد❗️"
config.oklinkon = "وضعیت تاییدلینک روشن شد❗️"
config.oklinkoff = "وضعیت تاییدلینک خاموش شد❗️"
config.autoleaveon = "خروج خودکار از گروه ها روشن شد❗️"
config.autoleaveoff = "خروج خودکار از گروه ها خاموش شد❗️"
config.sharenumon = "اشتراک گذاری شماره ربات روشن شد❗️"
config.sharenumoff = "اشتراک گذاری شماره ربات خاموش شد❗️"
config.markreadon = "تیک دوم پیام ها فعال شد❗️"
config.markreadoff = "تیک دوم پیام ها خاموش شد❗️"
config.setrealm = "به عنوان محل دریافت اعلانات تلگرام تنظیم شد❗️"
config.secertoon = "منشی گروه روشن شد❗️"
config.secertooff = "منشی گروه خاموش شد❗️"
config.delmaxgrouptex = "حداکثر تعداد گروه حذف شد❗️"
config.delminmembertex = "حداقل تعداد اعضای گروه حذف شد❗️"
config.resetlinks = "همه لینک ها از روی سرور حذف شد❗️"
config.resetslinks = "همه لینک های ذخیره شده از سرور حذف شد❗️"
config.resetpvs = "همه پیوی ها حذف شدند❗️"
config.rangeleftallfaild = "Range is wrong❗️\nAvailable range:[1-50]\nYour range:"
config.answeraddcontacts = { 
"ادی مرسی اه☺🍒", 
"ادی جیگر بپر پیوی🤤🍉", 
"ادت کردم تیز پیویم باش😑🙄😀", 
"Addi bia pv😆😍", 
"addi tiz sik pv🤓🙄", 
"ادی عشخم بپر پیوی 😉😆😍", 
"ادی پیوی نقطه بنداز😓🤧🎈", 
"ادی بیا پیوی، ادتم باز کن", 
"ادی ، هیع", 
"تو هم اد کردم", 
"تو هم ادی (:", 
"ادت کردم ^_^", 
"ادی تیز پیوی مرسی", 
"addi ♥♥", 
"adi amo :))", 
"add :'(", 
} 
return config